app/views/employments/index.html.slim

    tbody.border.text-center
      - @user.employment_histories.each do |employment_history|
---
SELECT `employments`.* FROM `employments`