app/controllers/employments_controller.rb

SELECT `employments`.* FROM `employments`
---
  def index
    @employments = Employment.all

INSERT INTO `employments` (`employer`, `date_started`, `date_employment_ended`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, '2022-08-03 09:40:25.517270', '2022-08-03 09:40:25.517270')
---
  def create
    @employment = Employment.new(employment_params)

    respond_to do |format|
      if @employment.save

SELECT `employments`.* FROM `employments` WHERE `employments`.`id` = 1 LIMIT 1
---
  def set_employment
    @employment = Employment.find(params[:id])