app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `nick_name`, `email`, `phone`, `created_at`, `updated_at`) VALUES ('test', 'test', 'test', 'test@gmail.com', '234-567-8911', '2022-08-03 09:35:45.351515', '2022-08-03 09:35:45.351515')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`email` = 'test@gmail.com', `users`.`updated_at` = '2022-08-03 09:53:54.809690' WHERE `users`.`id` = 2